[1]	H. C. KimH. C. Kim and D. Lee and K. Chon and B. Jang and T. Kwon and Y. Choi et al. 2010. Performance impact of large file transfer on web proxy caching: A case study in a high bandwidth campus network environment. Journal of Communications and Networks. 12, 1(2010), 52-66. DOI:https://doi.org/

[2]	M. HefeedaM. Hefeeda and B. Noorizadeh et al. 2010. On the Benefits of Cooperative Proxy Caching for Peer-to-Peer Traffic. IEEE Transactions on Parallel and Distributed Systems. 21, 7(2010), 998-1010. DOI:https://doi.org/

[3]	W. TuW. Tu and E. Steinbach and M. Muhammad and X. Li et al. 2009. Proxy Caching for Video-on-Demand Using Flexible Starting Point Selection. IEEE Transactions on Multimedia. 11, 4(2009), 716-729. DOI:https://doi.org/

[4]	J. P. G. OrtizJ. P. G. Ortiz and V. G. Ruiz and M. F. Lopez and I. Garcia et al. 2008. Interactive Transmission of JPEG2000 Images Using Web Proxy Caching. IEEE Transactions on Multimedia. 10, 4(2008), 629-636. DOI:https://doi.org/

[5]	C. L. ChanC. L. Chan and S. Y. Huang and J. S. Wang et al. 2007. Performance Analysis of Proxy Caching for VOD Services With Heterogeneous Clients. IEEE Transactions on Communications. 55, 11(2007), 2142-2151. DOI:https://doi.org/

[6]	C. F. KaoC. F. Kao and C. N. Lee et al. 2007. Aggregate Profit-Based Caching Replacement Algorithms for Streaming Media Transcoding Proxy Systems. IEEE Transactions on Multimedia. 9, 2(2007), 221-230. DOI:https://doi.org/

[7]	J. Z. WangJ. Z. Wang and P. S. Yu et al. 2007. Fragmental Proxy Caching for Streaming Multimedia Objects. IEEE Transactions on Multimedia. 9, 1(2007), 147-156. DOI:https://doi.org/

[8]	A. T. s. IpA. T. s. Ip and J. Liu and J. C. s. Lui et al. 2007. COPACC: An Architecture of Cooperative Proxy-Client Caching System for On-Demand Media Streaming. IEEE Transactions on Parallel and Distributed Systems. 18, 1(2007), 70-83. DOI:https://doi.org/

[9]	Songqing ChenSongqing Chen and Haining Wang and Xiaodong Zhang and B. Shen and S. Wee et al. 2005. Segment-based proxy caching for Internet streaming media delivery. IEEE MultiMedia. 12, 3(2005), 59-67. DOI:https://doi.org/

[10]	Kun-Lung WuKun-Lung Wu and P. S. Yu and J. L. Wolf et al. 2004. Segmentation of multimedia streams for proxy caching. IEEE Transactions on Multimedia. 6, 5(2004), 770-780. DOI:https://doi.org/

