[1]	B. DietrichB. Dietrich and D. Goswami and S. Chakraborty and A. Guha and M. Gries et al. 2015. Time Series Characterization of Gaming Workload for Runtime Power Management. IEEE Transactions on Computers. 64, 1(2015), 260-273. DOI:https://doi.org/

[2]	G. C. BurdeaG. C. Burdea and D. Cioi and A. Kale and W. E. Janes and S. A. Ross and J. R. Engsberg et al. 2013. Robotics and Gaming to Improve Ankle Strength, Motor Control, and Function in Children With Cerebral Palsy #x2014;A Case Study Series. IEEE Transactions on Neural Systems and Rehabilitation Engineering. 21, 2(2013), 165-173. DOI:https://doi.org/

[3]	T. G. PapaioannouT. G. Papaioannou and V. Hatzi and I. Koutsopoulos et al. 2018. Optimal Design of Serious Games for Consumer Engagement in the Smart Grid. IEEE Transactions on Smart Grid. 9, 2(2018), 1241-1249. DOI:https://doi.org/

[4]	J. ZhangJ. Zhang and T. Cui and C. Jin et al. 2018. Structural Attack on Reduced-Round Skipjack. IEEE Access. 6, 5(2018), 3176-3183. DOI:https://doi.org/

[5]	T. S. BabuT. S. Babu and J. P. Ram and T. DragiÄ?eviÄ‡ and M. Miyatake and F. Blaabjerg and N. Rajasekar et al. 2018. Particle Swarm Optimization Based Solar PV Array Reconfiguration of the Maximum Power Extraction Under Partial Shading Conditions. IEEE Transactions on Sustainable Energy. 9, 1(2018), 74-85. DOI:https://doi.org/

[6]	T. WangT. Wang and F. Liu and H. Xu et al. 2017. An Efficient Online Algorithm for Dynamic SDN Controller Assignment in Data Center Networks. IEEE/ACM Transactions on Networking. 25, 5(2017), 2788-2801. DOI:https://doi.org/

[7]	A. KhitunA. Khitun and G. Liu and A. A. Balandin et al. 2017. Two-Dimensional Oscillatory Neural Network Based on Room-Temperature Charge-Density-Wave Devices. IEEE Transactions on Nanotechnology. 16, 5(2017), 860-867. DOI:https://doi.org/

[8]	H. LiH. Li and X. Ding and A. Alsaedi and F. E. Alsaadi et al. 2017. Stochastic set stabilisation of n-person random evolutionary Boolean games and its applications. IET Control Theory Applications. 11, 13(2017), 2152-2160. DOI:https://doi.org/

[9]	Y. ZhengY. Zheng and D. Wu and Y. Ke and C. Yang and M. Chen and G. Zhang et al. 2017. Online Cloud Transcoding and Distribution for Crowdsourced Live Game Video Streaming. IEEE Transactions on Circuits and Systems for Video Technology. 27, 8(2017), 1777-1789. DOI:https://doi.org/

[10]	S. N. Mathaudhu. 2017. Superheroes and Scientists as Agents for Societal and Technological Advancement. IEEE Potentials. 36, 4(2017), 24-29. DOI:https://doi.org/

